org/lisp/clbe/clbe-9.org
#+DATE: 24 July 2021

#+TITLE: Basic Loops

Previous: [[file:clbe-8.org][8. Conditionals]]

Next: [[file:clbe-10.org][10. Local Variables & Functions]]

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

=DOTIMES= and =DOLIST= are basic loop macros for iteration. In the below
example, DOLIST will iterate over the items of my-list and execute the
loop body for each item of the list. my-variable holds the value of
each successive item in the list during the iteration.

#+begin_src lisp

  (dolist (my-variable my-list optional-result-form)
    body-form*)

#+end_src

#+begin_src lisp

   (dolist (i '(1 2 3 5 6 7))
     (print i))

#+end_src

In the below example, DOTIMES will iterate my-variable from 0 to one
less than the end-number supplied. If an optional-result-form is
supplied, it will be evaluated at the end of the loop. Below is the
structure of the macro, together with an example:

#+begin_src lisp

  (dotimes (my-variable end-number optional-result-form)
    body-form*)

#+end_src

#+begin_src lisp

  (dotimes (i 5 T)
    (print i))

#+end_src
