lisp/clbe/clbe-9.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Basic Loops</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Basic Loops</h1>
<p>
Previous: <a href="clbe-8.html">8. Conditionals</a>
</p>

<p>
Next: <a href="clbe-10.html">10. Local Variables &amp; Functions</a>
</p>

<p>
DOTIMES and DOLIST are basic loop macros for iteration. In the below
example, DOLIST will iterate over the items of my-list and execute the
loop body for each item of the list. my-variable holds the value of
each successive item in the list during the iteration.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">dolist</span> (my-variable my-list optional-result-form)
  body-form*)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">dolist</span> (i '(1 2 3 5 6 7))
  (print i))

</pre>
</div>

<p>
In the below example, DOTIMES will iterate my-variable from 0 to one
less than the end-number supplied. If an optional-result-form is
supplied, it will be evaluated at the end of the loop. Below is the
structure of the macro, together with an example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">dotimes</span> (my-variable end-number optional-result-form)
  body-form*)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">dotimes</span> (i 5 T)
  (print i))

</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
